astb_relise/src/DataProcessors/КорректировкаДанныхОВыдачеДляЛичнойКарточки/КорректировкаДанныхОВыдачеДляЛичнойКарточки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КорректировкаДанныхОВыдачеДляЛичнойКарточки</name>
  <comment>АСТБ_Горюшин_Алексей_19561</comment>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаДвижений</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>НормаВыдачи</name>
      <type>
        <types>CatalogRef.НормыВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаВыдачи</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеВыводитьВыдачуВ_ЛК</name>
      <comment>АСТБ_Горюшин_Алексей_19561</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Регистратор</name>
      <type>
        <types>DocumentRef.ВыдачаДежурныхСредствЗащиты</types>
        <types>DocumentRef.ЗачетВыданныхСредствЗащиты</types>
        <types>DocumentRef.ВыдачаСредствЗащитыСотруднику</types>
        <types>DocumentRef.КорректировкаРегистров</types>
        <types>DocumentRef.ЗачетУпрощеннойВыдачи</types>
        <types>DocumentRef.СписаниеСредствЗащитыСотрудника</types>
        <types>DocumentRef.ОбменСредствЗащитыСотрудника</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерСтрокиДвижения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбрабатыватьЗапись</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

astb_relise/src/AccumulationRegisters/ВыданныеСредстваЗащиты/ВыданныеСредстваЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВыданныеСредстваЗащиты</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>НеВыводитьВыдачуВ_ЛК</name>
    <comment>АСТБ_Горюшин_Алексей_19561</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХарактеристикаНоменклатуры</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроцентИзноса</name>
    <type>
      <types>CatalogRef.ПроцентыИзноса</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/DataProcessors/КорректировкаДанныхОВыдачеДляЛичнойКарточки/Forms/Форма/Module.bsl
///АСТБ_Горюшин_Алексей_19561

&НаСервере
Процедура ПрочитатьЗаписиНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыданныеСредстваЗащиты.Период КАК Период,
		|	ВыданныеСредстваЗащиты.Регистратор КАК Регистратор,
		|	ВыданныеСредстваЗащиты.НомерСтроки КАК НомерСтрокиДвижения,
		|	ВыданныеСредстваЗащиты.Активность КАК Активность,
		|	ВЫБОР
		|		КОГДА ВыданныеСредстваЗащиты.ВидДвижения = &ВидДвиженияПриход
		|			ТОГДА ""Приход""
		|		ИНАЧЕ ""Расход""
		|	КОНЕЦ КАК ВидДвижения,
		|	ВыданныеСредстваЗащиты.Организация КАК Организация,
		|	ВыданныеСредстваЗащиты.Сотрудник КАК Сотрудник,
		|	ВыданныеСредстваЗащиты.НормаВыдачи КАК НормаВыдачи,
		|	ВыданныеСредстваЗащиты.НоменклатураНормы КАК НоменклатураНормы,
		|	ВыданныеСредстваЗащиты.Номенклатура КАК Номенклатура,
		|	ВыданныеСредстваЗащиты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	ВыданныеСредстваЗащиты.ДатаВыдачи КАК ДатаВыдачи,
		|	ВыданныеСредстваЗащиты.Количество КАК Количество,
		|	ВыданныеСредстваЗащиты.НеВыводитьВыдачуВ_ЛК КАК НеВыводитьВыдачуВ_ЛК
		|ИЗ
		|	РегистрНакопления.ВыданныеСредстваЗащиты КАК ВыданныеСредстваЗащиты
		|ГДЕ
		|	ВыданныеСредстваЗащиты.Организация = &Организация
		|	И ВыданныеСредстваЗащиты.Сотрудник = &Сотрудник
		|	И ВыданныеСредстваЗащиты.ВидДвижения = &ВидДвиженияПриход";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	
	ТЗ_Результат = Запрос.Выполнить().Выгрузить();
	
	Объект.ТаблицаДвижений.Загрузить(ТЗ_Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьЗаписи(Команда)
	ПрочитатьЗаписиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДвиженийНеВыводитьВ_ЛКПриИзменении(Элемент)
	
	Элементы.ТаблицаДвижений.ТекущиеДанные.ОбрабатыватьЗапись = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДвиженияНаСервере()
	
	БылиОшибки = Ложь;
	
	Для Каждого Строка ИЗ Объект.ТаблицаДвижений Цикл
		
		Если Строка.ОбрабатыватьЗапись Тогда
			
			НаборЗаписей = РегистрыНакопления.ВыданныеСредстваЗащиты.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Регистратор.Установить(Строка.Регистратор);
 			НаборЗаписей.Прочитать();
			
			КоличествоЗаписей = НаборЗаписей.Количество();
			ПродолжатьОбработку = Истина;
			НомерТекущейЗаписи = 0;
			
			Пока НомерТекущейЗаписи < КоличествоЗаписей И ПродолжатьОбработку Цикл
				
				Запись = НаборЗаписей[НомерТекущейЗаписи];
			
				Если Запись.Организация = Объект.Организация
					И Запись.Сотрудник = Объект.Сотрудник
					И Запись.НомерСтроки = Строка.НомерСтрокиДвижения
					Тогда
				
					Запись.НеВыводитьВыдачуВ_ЛК = Строка.НеВыводитьВыдачуВ_ЛК;
				    ПродолжатьОбработку = Ложь;
					
				КонецЕсли;
				
				НомерТекущейЗаписи = НомерТекущейЗаписи + 1;
			
			КонецЦикла;
			
			НаборЗаписей.ОбменДанными.Загрузка = Истина;
			Попытка
				НаборЗаписей.Записать();
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
				БылиОшибки = Истина;
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если БылиОшибки Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("При записи возникли ошибки!");
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Запись движений успешно завершена!");
	КонецЕсли;
	
	ПрочитатьЗаписиНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДвижения(Команда)
	ЗаписатьДвиженияНаСервере();
КонецПроцедуры
